In [8]:
import pandas as pd

In [9]:
data=pd.read_csv("D:/05_DATA CLEANING AND PREPROCESSING/Employee_Salary_Dataset.csv")

In [4]:
print(data)

    ID  Experience_Years  Age  Gender    Salary
0    1                 5   28  Female    250000
1    2                 1   21    Male     50000
2    3                 3   23  Female    170000
3    4                 2   22    Male     25000
4    5                 1   17    Male     10000
5    6                25   62    Male   5001000
6    7                19   54  Female    800000
7    8                 2   21  Female      9000
8    9                10   36  Female     61500
9   10                15   54  Female    650000
10  11                 4   26  Female    250000
11  12                 6   29    Male   1400000
12  13                14   39    Male   6000050
13  14                11   40    Male    220100
14  15                 2   23    Male      7500
15  16                 4   27  Female     87000
16  17                10   34  Female    930000
17  18                15   54  Female   7900000
18  19                 2   21    Male     15000
19  20                10   36    Male    330000
20  21                15   54    Male   6570000
21  22                 4   26    Male     25000
22  23                 5   29    Male   6845000
23  24                 1   21  Female      6000
24  25                 4   23  Female      8900
25  26                 3   22  Female     20000
26  27                 1   18    Male      3000
27  28                27   62  Female  10000000
28  29                19   54  Female   5000000
29  30                 2   21  Female      6100
30  31                10   34    Male     80000
31  32                15   54    Male    900000
32  33                20   55  Female   1540000
33  34                19   53  Female   9300000
34  35                16   49    Male   7600000

In [5]:
print(data.head(10))

   ID  Experience_Years  Age  Gender   Salary
0   1                 5   28  Female   250000
1   2                 1   21    Male    50000
2   3                 3   23  Female   170000
3   4                 2   22    Male    25000
4   5                 1   17    Male    10000
5   6                25   62    Male  5001000
6   7                19   54  Female   800000
7   8                 2   21  Female     9000
8   9                10   36  Female    61500
9  10                15   54  Female   650000

In [6]:
print(data.tail(10))

    ID  Experience_Years  Age  Gender    Salary
25  26                 3   22  Female     20000
26  27                 1   18    Male      3000
27  28                27   62  Female  10000000
28  29                19   54  Female   5000000
29  30                 2   21  Female      6100
30  31                10   34    Male     80000
31  32                15   54    Male    900000
32  33                20   55  Female   1540000
33  34                19   53  Female   9300000
34  35                16   49    Male   7600000

In [7]:
print(data.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 35 entries, 0 to 34
Data columns (total 5 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   ID                35 non-null     int64
 1   Experience_Years  35 non-null     int64
 2   Age               35 non-null     int64
 3   Gender            35 non-null     object
 4   Salary            35 non-null     int64
dtypes: int64(4), object(1)
memory usage: 1.5+ KB
None

In [10]:
print(data)

    ID  Experience_Years  Age  Gender    Salary
0    1                 5   28  Female    250000
1    2                 1   21    Male     50000
2    3                 3   23  Female    170000
3    4                 2   22    Male     25000
4    5                 1   17    Male     10000
5    6                25   62    Male   5001000
6    7                19   54  Female    800000
7    8                 2   21  Female      9000
8    9                10   36  Female     61500
9   10                15   54  Female    650000
10  11                 4   26  Female    250000
11  12                 6   29    Male   1400000
12  13                14   39    Male   6000050
13  14                11   40    Male    220100
14  15                 2   23    Male      7500
15  16                 4   27  Female     87000
16  17                10   34  Female    930000
17  18                15   54  Female   7900000
18  19                 2   21    Male     15000
19  20                10   36    Male    330000
20  21                15   54    Male   6570000
21  22                 4   26    Male     25000
22  23                 5   29    Male   6845000
23  24                 1   21  Female      6000
24  25                 4   23  Female      8900
25  26                 3   22  Female     20000
26  27                 1   18    Male      3000
27  28                27   62  Female  10000000
28  29                19   54  Female   5000000
29  30                 2   21  Female      6100
30  31                10   34    Male     80000
31  32                15   54    Male    900000
32  33                20   55  Female   1540000
33  34                19   53  Female   9300000
34  35                16   49    Male   7600000

In [11]:
print(data.head(10))

   ID  Experience_Years  Age  Gender   Salary
0   1                 5   28  Female   250000
1   2                 1   21    Male    50000
2   3                 3   23  Female   170000
3   4                 2   22    Male    25000
4   5                 1   17    Male    10000
5   6                25   62    Male  5001000
6   7                19   54  Female   800000
7   8                 2   21  Female     9000
8   9                10   36  Female    61500
9  10                15   54  Female   650000

In [12]:
print(data.tail(10))

    ID  Experience_Years  Age  Gender    Salary
25  26                 3   22  Female     20000
26  27                 1   18    Male      3000
27  28                27   62  Female  10000000
28  29                19   54  Female   5000000
29  30                 2   21  Female      6100
30  31                10   34    Male     80000
31  32                15   54    Male    900000
32  33                20   55  Female   1540000
33  34                19   53  Female   9300000
34  35                16   49    Male   7600000

In [14]:
print(data.head(10))
print(data.tail(10))

   ID  Experience_Years  Age  Gender   Salary
0   1                 5   28  Female   250000
1   2                 1   21    Male    50000
2   3                 3   23  Female   170000
3   4                 2   22    Male    25000
4   5                 1   17    Male    10000
5   6                25   62    Male  5001000
6   7                19   54  Female   800000
7   8                 2   21  Female     9000
8   9                10   36  Female    61500
9  10                15   54  Female   650000
    ID  Experience_Years  Age  Gender    Salary
25  26                 3   22  Female     20000
26  27                 1   18    Male      3000
27  28                27   62  Female  10000000
28  29                19   54  Female   5000000
29  30                 2   21  Female      6100
30  31                10   34    Male     80000
31  32                15   54    Male    900000
32  33                20   55  Female   1540000
33  34                19   53  Female   9300000
34  35                16   49    Male   7600000

In [15]:
print(data.head(5))
print(data.tail(5))

   ID  Experience_Years  Age  Gender  Salary
0   1                 5   28  Female  250000
1   2                 1   21    Male   50000
2   3                 3   23  Female  170000
3   4                 2   22    Male   25000
4   5                 1   17    Male   10000
    ID  Experience_Years  Age  Gender   Salary
30  31                10   34    Male    80000
31  32                15   54    Male   900000
32  33                20   55  Female  1540000
33  34                19   53  Female  9300000
34  35                16   49    Male  7600000

In [17]:
print(data.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 35 entries, 0 to 34
Data columns (total 5 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   ID                35 non-null     int64
 1   Experience_Years  35 non-null     int64
 2   Age               35 non-null     int64
 3   Gender            35 non-null     object
 4   Salary            35 non-null     int64
dtypes: int64(4), object(1)
memory usage: 1.5+ KB
None

In [18]:
data.describe()

              ID  Experience_Years        Age        Salary
count  35.000000          35.00000  35.000000  3.500000e+01
mean   18.000000           9.20000  35.485714  2.059147e+06
std    10.246951           7.55295  14.643552  3.170124e+06
min     1.000000           1.00000  17.000000  3.000000e+03
25%     9.500000           2.50000  22.500000  2.250000e+04
50%    18.000000           6.00000  29.000000  2.500000e+05
75%    26.500000          15.00000  53.500000  3.270000e+06
max    35.000000          27.00000  62.000000  1.000000e+07

In [20]:
data.describe()

              ID  Experience_Years        Age        Salary
count  35.000000          35.00000  35.000000  3.500000e+01
mean   18.000000           9.20000  35.485714  2.059147e+06
std    10.246951           7.55295  14.643552  3.170124e+06
min     1.000000           1.00000  17.000000  3.000000e+03
25%     9.500000           2.50000  22.500000  2.250000e+04
50%    18.000000           6.00000  29.000000  2.500000e+05
75%    26.500000          15.00000  53.500000  3.270000e+06
max    35.000000          27.00000  62.000000  1.000000e+07

In [21]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 35 entries, 0 to 34
Data columns (total 5 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   ID                35 non-null     int64
 1   Experience_Years  35 non-null     int64
 2   Age               35 non-null     int64
 3   Gender            35 non-null     object
 4   Salary            35 non-null     int64
dtypes: int64(4), object(1)
memory usage: 1.5+ KB

In [22]:
print(data.isnull())

       ID  Experience_Years    Age  Gender  Salary
0   False             False  False   False   False
1   False             False  False   False   False
2   False             False  False   False   False
3   False             False  False   False   False
4   False             False  False   False   False
5   False             False  False   False   False
6   False             False  False   False   False
7   False             False  False   False   False
8   False             False  False   False   False
9   False             False  False   False   False
10  False             False  False   False   False
11  False             False  False   False   False
12  False             False  False   False   False
13  False             False  False   False   False
14  False             False  False   False   False
15  False             False  False   False   False
16  False             False  False   False   False
17  False             False  False   False   False
18  False             False  False   False   False
19  False             False  False   False   False
20  False             False  False   False   False
21  False             False  False   False   False
22  False             False  False   False   False
23  False             False  False   False   False
24  False             False  False   False   False
25  False             False  False   False   False
26  False             False  False   False   False
27  False             False  False   False   False
28  False             False  False   False   False
29  False             False  False   False   False
30  False             False  False   False   False
31  False             False  False   False   False
32  False             False  False   False   False
33  False             False  False   False   False
34  False             False  False   False   False

In [23]:
print(data.isnull().sum())

ID                  0
Experience_Years    0
Age                 0
Gender              0
Salary              0
dtype: int64

In [24]:
import numpy as np

In [26]:
data.describe()

              ID  Experience_Years        Age        Salary
count  35.000000          35.00000  35.000000  3.500000e+01
mean   18.000000           9.20000  35.485714  2.059147e+06
std    10.246951           7.55295  14.643552  3.170124e+06
min     1.000000           1.00000  17.000000  3.000000e+03
25%     9.500000           2.50000  22.500000  2.250000e+04
50%    18.000000           6.00000  29.000000  2.500000e+05
75%    26.500000          15.00000  53.500000  3.270000e+06
max    35.000000          27.00000  62.000000  1.000000e+07

In [27]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 35 entries, 0 to 34
Data columns (total 5 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   ID                35 non-null     int64
 1   Experience_Years  35 non-null     int64
 2   Age               35 non-null     int64
 3   Gender            35 non-null     object
 4   Salary            35 non-null     int64
dtypes: int64(4), object(1)
memory usage: 1.5+ KB

In [2]:
data=pd.read_csv("D:/05_DATA CLEANING AND PREPROCESSING/Pune house data.csv")

NameError: name 'pd' is not defined

In [30]:
print(data.head(10))

              area_type   availability       size  society total_sqft  bath  \
0  Super built-up  Area         19-Dec      2 BHK  Coomee        1056   2.0
1            Plot  Area  Ready To Move  4 Bedroom  Theanmp       2600   5.0
2        Built-up  Area  Ready To Move      3 BHK      NaN       1440   2.0
3  Super built-up  Area  Ready To Move      3 BHK  Soiewre       1521   3.0
4  Super built-up  Area  Ready To Move      2 BHK      NaN       1200   2.0
5  Super built-up  Area  Ready To Move      2 BHK  DuenaTa       1170   2.0
6  Super built-up  Area         18-May      4 BHK  Jaades        2732   4.0
7  Super built-up  Area  Ready To Move      4 BHK  Brway G       3300   4.0
8  Super built-up  Area  Ready To Move      3 BHK      NaN       1310   3.0
9            Plot  Area  Ready To Move  6 Bedroom      NaN       1020   6.0

   balcony   price    site_location
0      1.0   39.07      Alandi Road
1      3.0  120.00  Ambegaon Budruk
2      3.0   62.00       Anandnagar
3      1.0   95.00            Aundh
4      1.0   51.00       Aundh Road
5      1.0   38.00     Balaji Nagar
6      NaN  204.00            Baner
7      NaN  600.00       Baner road
8      1.0   63.25  Bhandarkar Road
9      NaN  370.00     Bhavani Peth

In [31]:
print(data.isnull())

       area_type  availability   size  society  total_sqft   bath  balcony  \
0          False         False  False    False       False  False    False
1          False         False  False    False       False  False    False
2          False         False  False     True       False  False    False
3          False         False  False    False       False  False    False
4          False         False  False     True       False  False    False
...          ...           ...    ...      ...         ...    ...      ...
13315      False         False  False    False       False  False    False
13316      False         False  False     True       False  False     True
13317      False         False  False    False       False  False    False
13318      False         False  False    False       False  False    False
13319      False         False  False     True       False  False    False

       price  site_location
0      False          False
1      False          False
2      False          False
3      False          False
4      False          False
...      ...            ...
13315  False          False
13316  False          False
13317  False          False
13318  False          False
13319  False          False

[13320 rows x 9 columns]

In [32]:
print(data.isnull().sum())

area_type           0
availability        0
size               16
society          5502
total_sqft          0
bath               73
balcony           609
price               0
site_location       1
dtype: int64

In [33]:
data.info

<bound method DataFrame.info of                   area_type   availability       size  society total_sqft  \
0      Super built-up  Area         19-Dec      2 BHK  Coomee        1056
1                Plot  Area  Ready To Move  4 Bedroom  Theanmp       2600
2            Built-up  Area  Ready To Move      3 BHK      NaN       1440
3      Super built-up  Area  Ready To Move      3 BHK  Soiewre       1521
4      Super built-up  Area  Ready To Move      2 BHK      NaN       1200
...                     ...            ...        ...      ...        ...
13315        Built-up  Area  Ready To Move  5 Bedroom  ArsiaEx       3453
13316  Super built-up  Area  Ready To Move      4 BHK      NaN       3600
13317        Built-up  Area  Ready To Move      2 BHK  Mahla T       1141
13318  Super built-up  Area         18-Jun      4 BHK  SollyCl       4689
13319  Super built-up  Area  Ready To Move      1 BHK      NaN        550

       bath  balcony   price         site_location
0       2.0      1.0   39.07           Alandi Road
1       5.0      3.0  120.00       Ambegaon Budruk
2       2.0      3.0   62.00            Anandnagar
3       3.0      1.0   95.00                 Aundh
4       2.0      1.0   51.00            Aundh Road
...     ...      ...     ...                   ...
13315   4.0      0.0  231.00                Pashan
13316   5.0      NaN  400.00             Paud Road
13317   2.0      1.0   60.00              Pirangut
13318   4.0      1.0  488.00          Prabhat Road
13319   1.0      1.0   17.00  Pune Railway Station

[13320 rows x 9 columns]>

In [35]:
print(data.describe)

<bound method NDFrame.describe of                   area_type   availability       size  society total_sqft  \
0      Super built-up  Area         19-Dec      2 BHK  Coomee        1056
1                Plot  Area  Ready To Move  4 Bedroom  Theanmp       2600
2            Built-up  Area  Ready To Move      3 BHK      NaN       1440
3      Super built-up  Area  Ready To Move      3 BHK  Soiewre       1521
4      Super built-up  Area  Ready To Move      2 BHK      NaN       1200
...                     ...            ...        ...      ...        ...
13315        Built-up  Area  Ready To Move  5 Bedroom  ArsiaEx       3453
13316  Super built-up  Area  Ready To Move      4 BHK      NaN       3600
13317        Built-up  Area  Ready To Move      2 BHK  Mahla T       1141
13318  Super built-up  Area         18-Jun      4 BHK  SollyCl       4689
13319  Super built-up  Area  Ready To Move      1 BHK      NaN        550

       bath  balcony   price         site_location
0       2.0      1.0   39.07           Alandi Road
1       5.0      3.0  120.00       Ambegaon Budruk
2       2.0      3.0   62.00            Anandnagar
3       3.0      1.0   95.00                 Aundh
4       2.0      1.0   51.00            Aundh Road
...     ...      ...     ...                   ...
13315   4.0      0.0  231.00                Pashan
13316   5.0      NaN  400.00             Paud Road
13317   2.0      1.0   60.00              Pirangut
13318   4.0      1.0  488.00          Prabhat Road
13319   1.0      1.0   17.00  Pune Railway Station

[13320 rows x 9 columns]>

In [36]:
data.describe()

               bath       balcony         price
count  13247.000000  12711.000000  13320.000000
mean       2.692610      1.584376    112.565627
std        1.341458      0.817263    148.971674
min        1.000000      0.000000      8.000000
25%        2.000000      1.000000     50.000000
50%        2.000000      2.000000     72.000000
75%        3.000000      2.000000    120.000000
max       40.000000      3.000000   3600.000000

In [37]:
print(data.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13320 entries, 0 to 13319
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   area_type      13320 non-null  object
 1   availability   13320 non-null  object
 2   size           13304 non-null  object
 3   society        7818 non-null   object
 4   total_sqft     13320 non-null  object
 5   bath           13247 non-null  float64
 6   balcony        12711 non-null  float64
 7   price          13320 non-null  float64
 8   site_location  13319 non-null  object
dtypes: float64(3), object(6)
memory usage: 936.7+ KB
None

In [39]:
print(data.isnull())

       area_type  availability   size  society  total_sqft   bath  balcony  \
0          False         False  False    False       False  False    False
1          False         False  False    False       False  False    False
2          False         False  False     True       False  False    False
3          False         False  False    False       False  False    False
4          False         False  False     True       False  False    False
...          ...           ...    ...      ...         ...    ...      ...
13315      False         False  False    False       False  False    False
13316      False         False  False     True       False  False     True
13317      False         False  False    False       False  False    False
13318      False         False  False    False       False  False    False
13319      False         False  False     True       False  False    False

       price  site_location
0      False          False
1      False          False
2      False          False
3      False          False
4      False          False
...      ...            ...
13315  False          False
13316  False          False
13317  False          False
13318  False          False
13319  False          False

[13320 rows x 9 columns]

In [40]:
print(data.isnull().sum())

area_type           0
availability        0
size               16
society          5502
total_sqft          0
bath               73
balcony           609
price               0
site_location       1
dtype: int64

In [4]:
import pandas as pd
data=pd.read_csv("D:/05_DATA CLEANING AND PREPROCESSING/Pune house data.csv")

In [5]:
print(data.head(10))

              area_type   availability       size  society total_sqft  bath  \
0  Super built-up  Area         19-Dec      2 BHK  Coomee        1056   2.0
1            Plot  Area  Ready To Move  4 Bedroom  Theanmp       2600   5.0
2        Built-up  Area  Ready To Move      3 BHK      NaN       1440   2.0
3  Super built-up  Area  Ready To Move      3 BHK  Soiewre       1521   3.0
4  Super built-up  Area  Ready To Move      2 BHK      NaN       1200   2.0
5  Super built-up  Area  Ready To Move      2 BHK  DuenaTa       1170   2.0
6  Super built-up  Area         18-May      4 BHK  Jaades        2732   4.0
7  Super built-up  Area  Ready To Move      4 BHK  Brway G       3300   4.0
8  Super built-up  Area  Ready To Move      3 BHK      NaN       1310   3.0
9            Plot  Area  Ready To Move  6 Bedroom      NaN       1020   6.0

   balcony   price    site_location
0      1.0   39.07      Alandi Road
1      3.0  120.00  Ambegaon Budruk
2      3.0   62.00       Anandnagar
3      1.0   95.00            Aundh
4      1.0   51.00       Aundh Road
5      1.0   38.00     Balaji Nagar
6      NaN  204.00            Baner
7      NaN  600.00       Baner road
8      1.0   63.25  Bhandarkar Road
9      NaN  370.00     Bhavani Peth

In [6]:
print(data.duplicated())

0        False
1        False
2        False
3        False
4        False
         ...
13315    False
13316    False
13317    False
13318    False
13319    False
Length: 13320, dtype: bool

In [7]:
print(data["area_type"].duplicated())

0        False
1        False
2        False
3         True
4         True
         ...
13315     True
13316     True
13317     True
13318     True
13319     True
Name: area_type, Length: 13320, dtype: bool

In [8]:
print(data["price"].duplicated())

0        False
1        False
2        False
3        False
4        False
         ...
13315    False
13316     True
13317     True
13318    False
13319     True
Name: price, Length: 13320, dtype: bool

In [9]:
print(data["area_type"].duplicated().sum())

13316

In [10]:
print(data)

                  area_type   availability       size  society total_sqft  \
0      Super built-up  Area         19-Dec      2 BHK  Coomee        1056
1                Plot  Area  Ready To Move  4 Bedroom  Theanmp       2600
2            Built-up  Area  Ready To Move      3 BHK      NaN       1440
3      Super built-up  Area  Ready To Move      3 BHK  Soiewre       1521
4      Super built-up  Area  Ready To Move      2 BHK      NaN       1200
...                     ...            ...        ...      ...        ...
13315        Built-up  Area  Ready To Move  5 Bedroom  ArsiaEx       3453
13316  Super built-up  Area  Ready To Move      4 BHK      NaN       3600
13317        Built-up  Area  Ready To Move      2 BHK  Mahla T       1141
13318  Super built-up  Area         18-Jun      4 BHK  SollyCl       4689
13319  Super built-up  Area  Ready To Move      1 BHK      NaN        550

       bath  balcony   price         site_location
0       2.0      1.0   39.07           Alandi Road
1       5.0      3.0  120.00       Ambegaon Budruk
2       2.0      3.0   62.00            Anandnagar
3       3.0      1.0   95.00                 Aundh
4       2.0      1.0   51.00            Aundh Road
...     ...      ...     ...                   ...
13315   4.0      0.0  231.00                Pashan
13316   5.0      NaN  400.00             Paud Road
13317   2.0      1.0   60.00              Pirangut
13318   4.0      1.0  488.00          Prabhat Road
13319   1.0      1.0   17.00  Pune Railway Station

[13320 rows x 9 columns]

In [13]:
print(data["price"].duplicated())

0        False
1        False
2        False
3        False
4        False
         ...
13315    False
13316     True
13317     True
13318    False
13319     True
Name: price, Length: 13320, dtype: bool

In [15]:
print(data["price"].duplicated().sum())

11326

In [17]:
print(data.isnull())

       area_type  availability   size  society  total_sqft   bath  balcony  \
0          False         False  False    False       False  False    False
1          False         False  False    False       False  False    False
2          False         False  False     True       False  False    False
3          False         False  False    False       False  False    False
4          False         False  False     True       False  False    False
...          ...           ...    ...      ...         ...    ...      ...
13315      False         False  False    False       False  False    False
13316      False         False  False     True       False  False     True
13317      False         False  False    False       False  False    False
13318      False         False  False    False       False  False    False
13319      False         False  False     True       False  False    False

       price  site_location
0      False          False
1      False          False
2      False          False
3      False          False
4      False          False
...      ...            ...
13315  False          False
13316  False          False
13317  False          False
13318  False          False
13319  False          False

[13320 rows x 9 columns]

In [18]:
print(data.isnull().sum())

area_type           0
availability        0
size               16
society          5502
total_sqft          0
bath               73
balcony           609
price               0
site_location       1
dtype: int64

In [19]:
print(data.isnull().sum())

area_type           0
availability        0
size               16
society          5502
total_sqft          0
bath               73
balcony           609
price               0
site_location       1
dtype: int64

In [22]:
print(data)

                  area_type   availability       size  society total_sqft  \
0      Super built-up  Area         19-Dec      2 BHK  Coomee        1056
1                Plot  Area  Ready To Move  4 Bedroom  Theanmp       2600
2            Built-up  Area  Ready To Move      3 BHK      NaN       1440
3      Super built-up  Area  Ready To Move      3 BHK  Soiewre       1521
4      Super built-up  Area  Ready To Move      2 BHK      NaN       1200
...                     ...            ...        ...      ...        ...
13315        Built-up  Area  Ready To Move  5 Bedroom  ArsiaEx       3453
13316  Super built-up  Area  Ready To Move      4 BHK      NaN       3600
13317        Built-up  Area  Ready To Move      2 BHK  Mahla T       1141
13318  Super built-up  Area         18-Jun      4 BHK  SollyCl       4689
13319  Super built-up  Area  Ready To Move      1 BHK      NaN        550

       bath  balcony   price         site_location
0       2.0      1.0   39.07           Alandi Road
1       5.0      3.0  120.00       Ambegaon Budruk
2       2.0      3.0   62.00            Anandnagar
3       3.0      1.0   95.00                 Aundh
4       2.0      1.0   51.00            Aundh Road
...     ...      ...     ...                   ...
13315   4.0      0.0  231.00                Pashan
13316   5.0      NaN  400.00             Paud Road
13317   2.0      1.0   60.00              Pirangut
13318   4.0      1.0  488.00          Prabhat Road
13319   1.0      1.0   17.00  Pune Railway Station

[13320 rows x 9 columns]

In [23]:
print(data["area_type"].duplicated())

0        False
1        False
2        False
3         True
4         True
         ...
13315     True
13316     True
13317     True
13318     True
13319     True
Name: area_type, Length: 13320, dtype: bool

In [24]:
print(data["price"].duplicated().sum())

11326

In [27]:
print(data.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13320 entries, 0 to 13319
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   area_type      13320 non-null  object
 1   availability   13320 non-null  object
 2   size           13304 non-null  object
 3   society        7818 non-null   object
 4   total_sqft     13320 non-null  object
 5   bath           13247 non-null  float64
 6   balcony        12711 non-null  float64
 7   price          13320 non-null  float64
 8   site_location  13319 non-null  object
dtypes: float64(3), object(6)
memory usage: 936.7+ KB
None

In [28]:
data.describe()

               bath       balcony         price
count  13247.000000  12711.000000  13320.000000
mean       2.692610      1.584376    112.565627
std        1.341458      0.817263    148.971674
min        1.000000      0.000000      8.000000
25%        2.000000      1.000000     50.000000
50%        2.000000      2.000000     72.000000
75%        3.000000      2.000000    120.000000
max       40.000000      3.000000   3600.000000

In [29]:
print(data.head(9))

              area_type   availability       size  society total_sqft  bath  \
0  Super built-up  Area         19-Dec      2 BHK  Coomee        1056   2.0
1            Plot  Area  Ready To Move  4 Bedroom  Theanmp       2600   5.0
2        Built-up  Area  Ready To Move      3 BHK      NaN       1440   2.0
3  Super built-up  Area  Ready To Move      3 BHK  Soiewre       1521   3.0
4  Super built-up  Area  Ready To Move      2 BHK      NaN       1200   2.0
5  Super built-up  Area  Ready To Move      2 BHK  DuenaTa       1170   2.0
6  Super built-up  Area         18-May      4 BHK  Jaades        2732   4.0
7  Super built-up  Area  Ready To Move      4 BHK  Brway G       3300   4.0
8  Super built-up  Area  Ready To Move      3 BHK      NaN       1310   3.0

   balcony   price    site_location
0      1.0   39.07      Alandi Road
1      3.0  120.00  Ambegaon Budruk
2      3.0   62.00       Anandnagar
3      1.0   95.00            Aundh
4      1.0   51.00       Aundh Road
5      1.0   38.00     Balaji Nagar
6      NaN  204.00            Baner
7      NaN  600.00       Baner road
8      1.0   63.25  Bhandarkar Road

In [30]:
print(data.tail(23))

                  area_type   availability       size  society   total_sqft  \
13297  Super built-up  Area  Ready To Move      2 BHK  GMown E         1060
13298  Super built-up  Area  Ready To Move      2 BHK  AriosPa         1015
13299  Super built-up  Area         18-Dec      4 BHK  Prtates  2830 - 2882
13300            Plot  Area  Ready To Move  5 Bedroom      NaN         1500
13301  Super built-up  Area  Ready To Move      3 BHK      NaN         1454
13302  Super built-up  Area  Ready To Move      2 BHK      NaN         1075
13303            Plot  Area  Ready To Move  5 Bedroom      NaN          774
13304  Super built-up  Area  Ready To Move      2 BHK  GrrvaGr         1187
13305          Carpet  Area  Ready To Move      1 BHK      NaN          500
13306            Plot  Area  Ready To Move  4 Bedroom      NaN         1200
13307        Built-up  Area  Ready To Move      3 BHK      NaN         1805
13308        Built-up  Area  Ready To Move      3 BHK  Baanise         1527
13309  Super built-up  Area  Ready To Move      3 BHK  IBityin         1675
13310  Super built-up  Area  Ready To Move      2 BHK      NaN         1050
13311            Plot  Area  Ready To Move  7 Bedroom      NaN         1500
13312  Super built-up  Area  Ready To Move      2 BHK      NaN         1262
13313  Super built-up  Area  Ready To Move      3 BHK  Aklia R         1345
13314  Super built-up  Area  Ready To Move      3 BHK  SoosePr         1715
13315        Built-up  Area  Ready To Move  5 Bedroom  ArsiaEx         3453
13316  Super built-up  Area  Ready To Move      4 BHK      NaN         3600
13317        Built-up  Area  Ready To Move      2 BHK  Mahla T         1141
13318  Super built-up  Area         18-Jun      4 BHK  SollyCl         4689
13319  Super built-up  Area  Ready To Move      1 BHK      NaN          550

       bath  balcony   price         site_location
13297   2.0      1.0   52.00               Kothrud
13298   2.0      2.0   60.00      Law College Road
13299   5.0      0.0  154.50            Laxmi Road
13300   6.0      2.0  145.00           Lulla Nagar
13301   3.0      3.0   71.50   Mahatma Gandhi Road
13302   2.0      2.0   48.00        Mangalwar peth
13303   5.0      3.0   70.00            Manik Bagh
13304   2.0      2.0   40.14           Market yard
13305   1.0      3.0  220.00          Model colony
13306   5.0      NaN  325.00          Mukund Nagar
13307   3.0      3.0  134.00              Mundhawa
13308   3.0      1.0  142.00            Nagar Road
13309   3.0      NaN   92.13             Nana Peth
13310   2.0      2.0   52.71          Narayan Peth
13311   9.0      2.0  250.00           Narayangaon
13312   2.0      2.0   47.00             Navi Peth
13313   2.0      1.0   57.00             Padmavati
13314   3.0      3.0  112.00       Parvati Darshan
13315   4.0      0.0  231.00                Pashan
13316   5.0      NaN  400.00             Paud Road
13317   2.0      1.0   60.00              Pirangut
13318   4.0      1.0  488.00          Prabhat Road
13319   1.0      1.0   17.00  Pune Railway Station

In [31]:
print(data.isnull)

<bound method DataFrame.isnull of                   area_type   availability       size  society total_sqft  \
0      Super built-up  Area         19-Dec      2 BHK  Coomee        1056
1                Plot  Area  Ready To Move  4 Bedroom  Theanmp       2600
2            Built-up  Area  Ready To Move      3 BHK      NaN       1440
3      Super built-up  Area  Ready To Move      3 BHK  Soiewre       1521
4      Super built-up  Area  Ready To Move      2 BHK      NaN       1200
...                     ...            ...        ...      ...        ...
13315        Built-up  Area  Ready To Move  5 Bedroom  ArsiaEx       3453
13316  Super built-up  Area  Ready To Move      4 BHK      NaN       3600
13317        Built-up  Area  Ready To Move      2 BHK  Mahla T       1141
13318  Super built-up  Area         18-Jun      4 BHK  SollyCl       4689
13319  Super built-up  Area  Ready To Move      1 BHK      NaN        550

       bath  balcony   price         site_location
0       2.0      1.0   39.07           Alandi Road
1       5.0      3.0  120.00       Ambegaon Budruk
2       2.0      3.0   62.00            Anandnagar
3       3.0      1.0   95.00                 Aundh
4       2.0      1.0   51.00            Aundh Road
...     ...      ...     ...                   ...
13315   4.0      0.0  231.00                Pashan
13316   5.0      NaN  400.00             Paud Road
13317   2.0      1.0   60.00              Pirangut
13318   4.0      1.0  488.00          Prabhat Road
13319   1.0      1.0   17.00  Pune Railway Station

[13320 rows x 9 columns]>

In [37]:
print(data.isnull().sum())

area_type           0
availability        0
size               16
society          5502
total_sqft          0
bath               73
balcony           609
price               0
site_location       1
dtype: int64

In [38]:
print(data.duplicated())

0        False
1        False
2        False
3        False
4        False
         ...
13315    False
13316    False
13317    False
13318    False
13319    False
Length: 13320, dtype: bool

In [39]:
print(data.duplicated().sum())

11

In [40]:
print(data.describe())

               bath       balcony         price
count  13247.000000  12711.000000  13320.000000
mean       2.692610      1.584376    112.565627
std        1.341458      0.817263    148.971674
min        1.000000      0.000000      8.000000
25%        2.000000      1.000000     50.000000
50%        2.000000      2.000000     72.000000
75%        3.000000      2.000000    120.000000
max       40.000000      3.000000   3600.000000

In [41]:
data.info

<bound method DataFrame.info of                   area_type   availability       size  society total_sqft  \
0      Super built-up  Area         19-Dec      2 BHK  Coomee        1056
1                Plot  Area  Ready To Move  4 Bedroom  Theanmp       2600
2            Built-up  Area  Ready To Move      3 BHK      NaN       1440
3      Super built-up  Area  Ready To Move      3 BHK  Soiewre       1521
4      Super built-up  Area  Ready To Move      2 BHK      NaN       1200
...                     ...            ...        ...      ...        ...
13315        Built-up  Area  Ready To Move  5 Bedroom  ArsiaEx       3453
13316  Super built-up  Area  Ready To Move      4 BHK      NaN       3600
13317        Built-up  Area  Ready To Move      2 BHK  Mahla T       1141
13318  Super built-up  Area         18-Jun      4 BHK  SollyCl       4689
13319  Super built-up  Area  Ready To Move      1 BHK      NaN        550

       bath  balcony   price         site_location
0       2.0      1.0   39.07           Alandi Road
1       5.0      3.0  120.00       Ambegaon Budruk
2       2.0      3.0   62.00            Anandnagar
3       3.0      1.0   95.00                 Aundh
4       2.0      1.0   51.00            Aundh Road
...     ...      ...     ...                   ...
13315   4.0      0.0  231.00                Pashan
13316   5.0      NaN  400.00             Paud Road
13317   2.0      1.0   60.00              Pirangut
13318   4.0      1.0  488.00          Prabhat Road
13319   1.0      1.0   17.00  Pune Railway Station

[13320 rows x 9 columns]>

In [42]:
print(data["site_location"].duplicated().sum())

13222

In [43]:
import numpy as np

In [44]:
bak_food=[200,234,94,244,564,345]
a=np.array(bak_food)

In [46]:
print(np.mean(bak_food))

280.1666666666667

In [48]:
import numpy as np
bak_food=[200,345,846,732,946]
a=np.array(bak_food)
print(a)
print(np.mean(bak_food))
print(np.median(bak_food))
print(np.std(bak_food))
print(np.var(bak_food))

[200 345 846 732 946]
613.8
732.0
290.42341503398103
84345.76

In [49]:
data=pd.read_csv("D:/05_DATA CLEANING AND PREPROCESSING/Pune house data.csv")

In [50]:
print(data)

                  area_type   availability       size  society total_sqft  \
0      Super built-up  Area         19-Dec      2 BHK  Coomee        1056
1                Plot  Area  Ready To Move  4 Bedroom  Theanmp       2600
2            Built-up  Area  Ready To Move      3 BHK      NaN       1440
3      Super built-up  Area  Ready To Move      3 BHK  Soiewre       1521
4      Super built-up  Area  Ready To Move      2 BHK      NaN       1200
...                     ...            ...        ...      ...        ...
13315        Built-up  Area  Ready To Move  5 Bedroom  ArsiaEx       3453
13316  Super built-up  Area  Ready To Move      4 BHK      NaN       3600
13317        Built-up  Area  Ready To Move      2 BHK  Mahla T       1141
13318  Super built-up  Area         18-Jun      4 BHK  SollyCl       4689
13319  Super built-up  Area  Ready To Move      1 BHK      NaN        550

       bath  balcony   price         site_location
0       2.0      1.0   39.07           Alandi Road
1       5.0      3.0  120.00       Ambegaon Budruk
2       2.0      3.0   62.00            Anandnagar
3       3.0      1.0   95.00                 Aundh
4       2.0      1.0   51.00            Aundh Road
...     ...      ...     ...                   ...
13315   4.0      0.0  231.00                Pashan
13316   5.0      NaN  400.00             Paud Road
13317   2.0      1.0   60.00              Pirangut
13318   4.0      1.0  488.00          Prabhat Road
13319   1.0      1.0   17.00  Pune Railway Station

[13320 rows x 9 columns]

print(data.describe())

In [52]:
print(data.isnull().sum())

area_type           0
availability        0
size               16
society          5502
total_sqft          0
bath               73
balcony           609
price               0
site_location       1
dtype: int64

In [53]:
print(data.duplicated())

0        False
1        False
2        False
3        False
4        False
         ...
13315    False
13316    False
13317    False
13318    False
13319    False
Length: 13320, dtype: bool

In [54]:
print(data.tail(10))

                  area_type   availability       size  society total_sqft  \
13310  Super built-up  Area  Ready To Move      2 BHK      NaN       1050
13311            Plot  Area  Ready To Move  7 Bedroom      NaN       1500
13312  Super built-up  Area  Ready To Move      2 BHK      NaN       1262
13313  Super built-up  Area  Ready To Move      3 BHK  Aklia R       1345
13314  Super built-up  Area  Ready To Move      3 BHK  SoosePr       1715
13315        Built-up  Area  Ready To Move  5 Bedroom  ArsiaEx       3453
13316  Super built-up  Area  Ready To Move      4 BHK      NaN       3600
13317        Built-up  Area  Ready To Move      2 BHK  Mahla T       1141
13318  Super built-up  Area         18-Jun      4 BHK  SollyCl       4689
13319  Super built-up  Area  Ready To Move      1 BHK      NaN        550

       bath  balcony   price         site_location
13310   2.0      2.0   52.71          Narayan Peth
13311   9.0      2.0  250.00           Narayangaon
13312   2.0      2.0   47.00             Navi Peth
13313   2.0      1.0   57.00             Padmavati
13314   3.0      3.0  112.00       Parvati Darshan
13315   4.0      0.0  231.00                Pashan
13316   5.0      NaN  400.00             Paud Road
13317   2.0      1.0   60.00              Pirangut
13318   4.0      1.0  488.00          Prabhat Road
13319   1.0      1.0   17.00  Pune Railway Station

In [55]:
print(data.describe())

               bath       balcony         price
count  13247.000000  12711.000000  13320.000000
mean       2.692610      1.584376    112.565627
std        1.341458      0.817263    148.971674
min        1.000000      0.000000      8.000000
25%        2.000000      1.000000     50.000000
50%        2.000000      2.000000     72.000000
75%        3.000000      2.000000    120.000000
max       40.000000      3.000000   3600.000000

In [56]:
print(data.duplicated())

0        False
1        False
2        False
3        False
4        False
         ...
13315    False
13316    False
13317    False
13318    False
13319    False
Length: 13320, dtype: bool

In [59]:
print(data)

                  area_type   availability       size  society total_sqft  \
0      Super built-up  Area         19-Dec      2 BHK  Coomee        1056
1                Plot  Area  Ready To Move  4 Bedroom  Theanmp       2600
2            Built-up  Area  Ready To Move      3 BHK      NaN       1440
3      Super built-up  Area  Ready To Move      3 BHK  Soiewre       1521
4      Super built-up  Area  Ready To Move      2 BHK      NaN       1200
...                     ...            ...        ...      ...        ...
13315        Built-up  Area  Ready To Move  5 Bedroom  ArsiaEx       3453
13316  Super built-up  Area  Ready To Move      4 BHK      NaN       3600
13317        Built-up  Area  Ready To Move      2 BHK  Mahla T       1141
13318  Super built-up  Area         18-Jun      4 BHK  SollyCl       4689
13319  Super built-up  Area  Ready To Move      1 BHK      NaN        550

       bath  balcony   price         site_location
0       2.0      1.0   39.07           Alandi Road
1       5.0      3.0  120.00       Ambegaon Budruk
2       2.0      3.0   62.00            Anandnagar
3       3.0      1.0   95.00                 Aundh
4       2.0      1.0   51.00            Aundh Road
...     ...      ...     ...                   ...
13315   4.0      0.0  231.00                Pashan
13316   5.0      NaN  400.00             Paud Road
13317   2.0      1.0   60.00              Pirangut
13318   4.0      1.0  488.00          Prabhat Road
13319   1.0      1.0   17.00  Pune Railway Station

[13320 rows x 9 columns]

In [60]:
print(data)

                  area_type   availability       size  society total_sqft  \
0      Super built-up  Area         19-Dec      2 BHK  Coomee        1056
1                Plot  Area  Ready To Move  4 Bedroom  Theanmp       2600
2            Built-up  Area  Ready To Move      3 BHK      NaN       1440
3      Super built-up  Area  Ready To Move      3 BHK  Soiewre       1521
4      Super built-up  Area  Ready To Move      2 BHK      NaN       1200
...                     ...            ...        ...      ...        ...
13315        Built-up  Area  Ready To Move  5 Bedroom  ArsiaEx       3453
13316  Super built-up  Area  Ready To Move      4 BHK      NaN       3600
13317        Built-up  Area  Ready To Move      2 BHK  Mahla T       1141
13318  Super built-up  Area         18-Jun      4 BHK  SollyCl       4689
13319  Super built-up  Area  Ready To Move      1 BHK      NaN        550

       bath  balcony   price         site_location
0       2.0      1.0   39.07           Alandi Road
1       5.0      3.0  120.00       Ambegaon Budruk
2       2.0      3.0   62.00            Anandnagar
3       3.0      1.0   95.00                 Aundh
4       2.0      1.0   51.00            Aundh Road
...     ...      ...     ...                   ...
13315   4.0      0.0  231.00                Pashan
13316   5.0      NaN  400.00             Paud Road
13317   2.0      1.0   60.00              Pirangut
13318   4.0      1.0  488.00          Prabhat Road
13319   1.0      1.0   17.00  Pune Railway Station

[13320 rows x 9 columns]

In [64]:
print(data["area_type"].duplicated().sum())

13316

In [66]:
print(data["site_location"].duplicated().sum())

13222

In [19]:
import pandas as pd 
import numpy as np
data=pd.read_csv("D:/05_DATA CLEANING AND PREPROCESSING/Employee_Salary_Dataset.csv")
print(data.head(10))

   ID  Experience_Years  Age  Gender   Salary
0   1                 5   28  Female   250000
1   2                 1   21    Male    50000
2   3                 3   23  Female   170000
3   4                 2   22    Male    25000
4   5                 1   17    Male    10000
5   6                25   62    Male  5001000
6   7                19   54  Female   800000
7   8                 2   21  Female     9000
8   9                10   36  Female    61500
9  10                15   54  Female   650000

In [16]:
print(data["Age"].duplicated().sum())

17

In [17]:
print(data.drop_duplicates("Age"))

    ID  Experience_Years  Age  Gender   Salary
0    1                 5   28  Female   250000
1    2                 1   21    Male    50000
2    3                 3   23  Female   170000
3    4                 2   22    Male    25000
4    5                 1   17    Male    10000
5    6                25   62    Male  5001000
6    7                19   54  Female   800000
8    9                10   36  Female    61500
10  11                 4   26  Female   250000
11  12                 6   29    Male  1400000
12  13                14   39    Male  6000050
13  14                11   40    Male   220100
15  16                 4   27  Female    87000
16  17                10   34  Female   930000
26  27                 1   18    Male     3000
32  33                20   55  Female  1540000
33  34                19   53  Female  9300000
34  35                16   49    Male  7600000

In [18]:
print(data["Age"].duplicated().sum())

17

In [41]:
import pandas as pd 
import numpy as np
data=pd.read_csv("D:/05_DATA CLEANING AND PREPROCESSING/Pune house data.csv")
print(data.head(10))

              area_type   availability       size  society total_sqft  bath  \
0  Super built-up  Area         19-Dec      2 BHK  Coomee        1056   2.0
1            Plot  Area  Ready To Move  4 Bedroom  Theanmp       2600   5.0
2        Built-up  Area  Ready To Move      3 BHK      NaN       1440   2.0
3  Super built-up  Area  Ready To Move      3 BHK  Soiewre       1521   3.0
4  Super built-up  Area  Ready To Move      2 BHK      NaN       1200   2.0
5  Super built-up  Area  Ready To Move      2 BHK  DuenaTa       1170   2.0
6  Super built-up  Area         18-May      4 BHK  Jaades        2732   4.0
7  Super built-up  Area  Ready To Move      4 BHK  Brway G       3300   4.0
8  Super built-up  Area  Ready To Move      3 BHK      NaN       1310   3.0
9            Plot  Area  Ready To Move  6 Bedroom      NaN       1020   6.0

   balcony   price    site_location
0      1.0   39.07      Alandi Road
1      3.0  120.00  Ambegaon Budruk
2      3.0   62.00       Anandnagar
3      1.0   95.00            Aundh
4      1.0   51.00       Aundh Road
5      1.0   38.00     Balaji Nagar
6      NaN  204.00            Baner
7      NaN  600.00       Baner road
8      1.0   63.25  Bhandarkar Road
9      NaN  370.00     Bhavani Peth

In [24]:
print(data.isnull().sum())

area_type           0
availability        0
size               16
society          5502
total_sqft          0
bath               73
balcony           609
price               0
site_location       1
dtype: int64

In [26]:
print(data)

                  area_type   availability       size  society total_sqft  \
0      Super built-up  Area         19-Dec      2 BHK  Coomee        1056
1                Plot  Area  Ready To Move  4 Bedroom  Theanmp       2600
2            Built-up  Area  Ready To Move      3 BHK      NaN       1440
3      Super built-up  Area  Ready To Move      3 BHK  Soiewre       1521
4      Super built-up  Area  Ready To Move      2 BHK      NaN       1200
...                     ...            ...        ...      ...        ...
13315        Built-up  Area  Ready To Move  5 Bedroom  ArsiaEx       3453
13316  Super built-up  Area  Ready To Move      4 BHK      NaN       3600
13317        Built-up  Area  Ready To Move      2 BHK  Mahla T       1141
13318  Super built-up  Area         18-Jun      4 BHK  SollyCl       4689
13319  Super built-up  Area  Ready To Move      1 BHK      NaN        550

       bath  balcony   price         site_location
0       2.0      1.0   39.07           Alandi Road
1       5.0      3.0  120.00       Ambegaon Budruk
2       2.0      3.0   62.00            Anandnagar
3       3.0      1.0   95.00                 Aundh
4       2.0      1.0   51.00            Aundh Road
...     ...      ...     ...                   ...
13315   4.0      0.0  231.00                Pashan
13316   5.0      NaN  400.00             Paud Road
13317   2.0      1.0   60.00              Pirangut
13318   4.0      1.0  488.00          Prabhat Road
13319   1.0      1.0   17.00  Pune Railway Station

[13320 rows x 9 columns]

In [27]:
print(data.dropna())

                  area_type   availability       size  society total_sqft  \
0      Super built-up  Area         19-Dec      2 BHK  Coomee        1056
1                Plot  Area  Ready To Move  4 Bedroom  Theanmp       2600
3      Super built-up  Area  Ready To Move      3 BHK  Soiewre       1521
5      Super built-up  Area  Ready To Move      2 BHK  DuenaTa       1170
11               Plot  Area  Ready To Move  4 Bedroom  Prrry M       2785
...                     ...            ...        ...      ...        ...
13313  Super built-up  Area  Ready To Move      3 BHK  Aklia R       1345
13314  Super built-up  Area  Ready To Move      3 BHK  SoosePr       1715
13315        Built-up  Area  Ready To Move  5 Bedroom  ArsiaEx       3453
13317        Built-up  Area  Ready To Move      2 BHK  Mahla T       1141
13318  Super built-up  Area         18-Jun      4 BHK  SollyCl       4689

       bath  balcony   price    site_location
0       2.0      1.0   39.07      Alandi Road
1       5.0      3.0  120.00  Ambegaon Budruk
3       3.0      1.0   95.00            Aundh
5       2.0      1.0   38.00     Balaji Nagar
11      5.0      3.0  295.00           Bopodi
...     ...      ...     ...              ...
13313   2.0      1.0   57.00        Padmavati
13314   3.0      3.0  112.00  Parvati Darshan
13315   4.0      0.0  231.00           Pashan
13317   2.0      1.0   60.00         Pirangut
13318   4.0      1.0  488.00     Prabhat Road

[7496 rows x 9 columns]

In [28]:
print(data.isnull())

       area_type  availability   size  society  total_sqft   bath  balcony  \
0          False         False  False    False       False  False    False
1          False         False  False    False       False  False    False
2          False         False  False     True       False  False    False
3          False         False  False    False       False  False    False
4          False         False  False     True       False  False    False
...          ...           ...    ...      ...         ...    ...      ...
13315      False         False  False    False       False  False    False
13316      False         False  False     True       False  False     True
13317      False         False  False    False       False  False    False
13318      False         False  False    False       False  False    False
13319      False         False  False     True       False  False    False

       price  site_location
0      False          False
1      False          False
2      False          False
3      False          False
4      False          False
...      ...            ...
13315  False          False
13316  False          False
13317  False          False
13318  False          False
13319  False          False

[13320 rows x 9 columns]

In [35]:
print(data.head(11))

               area_type   availability       size  society total_sqft  bath  \
0   Super built-up  Area         19-Dec      2 BHK  Coomee        1056   2.0
1             Plot  Area  Ready To Move  4 Bedroom  Theanmp       2600   5.0
2         Built-up  Area  Ready To Move      3 BHK      NaN       1440   2.0
3   Super built-up  Area  Ready To Move      3 BHK  Soiewre       1521   3.0
4   Super built-up  Area  Ready To Move      2 BHK      NaN       1200   2.0
5   Super built-up  Area  Ready To Move      2 BHK  DuenaTa       1170   2.0
6   Super built-up  Area         18-May      4 BHK  Jaades        2732   4.0
7   Super built-up  Area  Ready To Move      4 BHK  Brway G       3300   4.0
8   Super built-up  Area  Ready To Move      3 BHK      NaN       1310   3.0
9             Plot  Area  Ready To Move  6 Bedroom      NaN       1020   6.0
10  Super built-up  Area         18-Feb      3 BHK      NaN       1800   2.0

    balcony   price    site_location
0       1.0   39.07      Alandi Road
1       3.0  120.00  Ambegaon Budruk
2       3.0   62.00       Anandnagar
3       1.0   95.00            Aundh
4       1.0   51.00       Aundh Road
5       1.0   38.00     Balaji Nagar
6       NaN  204.00            Baner
7       NaN  600.00       Baner road
8       1.0   63.25  Bhandarkar Road
9       NaN  370.00     Bhavani Peth
10      2.0   70.00        Bibvewadi

In [36]:
import numpy as np

In [38]:
print(data.replace(np.nan,"**************"))

                  area_type   availability       size         society  \
0      Super built-up  Area         19-Dec      2 BHK         Coomee
1                Plot  Area  Ready To Move  4 Bedroom         Theanmp
2            Built-up  Area  Ready To Move      3 BHK  **************
3      Super built-up  Area  Ready To Move      3 BHK         Soiewre
4      Super built-up  Area  Ready To Move      2 BHK  **************
...                     ...            ...        ...             ...
13315        Built-up  Area  Ready To Move  5 Bedroom         ArsiaEx
13316  Super built-up  Area  Ready To Move      4 BHK  **************
13317        Built-up  Area  Ready To Move      2 BHK         Mahla T
13318  Super built-up  Area         18-Jun      4 BHK         SollyCl
13319  Super built-up  Area  Ready To Move      1 BHK  **************

      total_sqft bath         balcony   price         site_location
0           1056  2.0             1.0   39.07           Alandi Road
1           2600  5.0             3.0  120.00       Ambegaon Budruk
2           1440  2.0             3.0   62.00            Anandnagar
3           1521  3.0             1.0   95.00                 Aundh
4           1200  2.0             1.0   51.00            Aundh Road
...          ...  ...             ...     ...                   ...
13315       3453  4.0             0.0  231.00                Pashan
13316       3600  5.0  **************  400.00             Paud Road
13317       1141  2.0             1.0   60.00              Pirangut
13318       4689  4.0             1.0  488.00          Prabhat Road
13319        550  1.0             1.0   17.00  Pune Railway Station

[13320 rows x 9 columns]

In [40]:
data["society"]=data["society"].replace(np.nan,"bhushansanjayzade")
print(data)

                  area_type   availability       size            society  \
0      Super built-up  Area         19-Dec      2 BHK            Coomee
1                Plot  Area  Ready To Move  4 Bedroom            Theanmp
2            Built-up  Area  Ready To Move      3 BHK  bhushansanjayzade
3      Super built-up  Area  Ready To Move      3 BHK            Soiewre
4      Super built-up  Area  Ready To Move      2 BHK  bhushansanjayzade
...                     ...            ...        ...                ...
13315        Built-up  Area  Ready To Move  5 Bedroom            ArsiaEx
13316  Super built-up  Area  Ready To Move      4 BHK  bhushansanjayzade
13317        Built-up  Area  Ready To Move      2 BHK            Mahla T
13318  Super built-up  Area         18-Jun      4 BHK            SollyCl
13319  Super built-up  Area  Ready To Move      1 BHK  bhushansanjayzade

      total_sqft  bath  balcony   price         site_location
0           1056   2.0      1.0   39.07           Alandi Road
1           2600   5.0      3.0  120.00       Ambegaon Budruk
2           1440   2.0      3.0   62.00            Anandnagar
3           1521   3.0      1.0   95.00                 Aundh
4           1200   2.0      1.0   51.00            Aundh Road
...          ...   ...      ...     ...                   ...
13315       3453   4.0      0.0  231.00                Pashan
13316       3600   5.0      NaN  400.00             Paud Road
13317       1141   2.0      1.0   60.00              Pirangut
13318       4689   4.0      1.0  488.00          Prabhat Road
13319        550   1.0      1.0   17.00  Pune Railway Station

[13320 rows x 9 columns]

In [42]:
import pandas as pd 
import numpy as np
data=pd.read_csv("D:/05_DATA CLEANING AND PREPROCESSING/Pune house data.csv")
print(data.head(10))

              area_type   availability       size  society total_sqft  bath  \
0  Super built-up  Area         19-Dec      2 BHK  Coomee        1056   2.0
1            Plot  Area  Ready To Move  4 Bedroom  Theanmp       2600   5.0
2        Built-up  Area  Ready To Move      3 BHK      NaN       1440   2.0
3  Super built-up  Area  Ready To Move      3 BHK  Soiewre       1521   3.0
4  Super built-up  Area  Ready To Move      2 BHK      NaN       1200   2.0
5  Super built-up  Area  Ready To Move      2 BHK  DuenaTa       1170   2.0
6  Super built-up  Area         18-May      4 BHK  Jaades        2732   4.0
7  Super built-up  Area  Ready To Move      4 BHK  Brway G       3300   4.0
8  Super built-up  Area  Ready To Move      3 BHK      NaN       1310   3.0
9            Plot  Area  Ready To Move  6 Bedroom      NaN       1020   6.0

   balcony   price    site_location
0      1.0   39.07      Alandi Road
1      3.0  120.00  Ambegaon Budruk
2      3.0   62.00       Anandnagar
3      1.0   95.00            Aundh
4      1.0   51.00       Aundh Road
5      1.0   38.00     Balaji Nagar
6      NaN  204.00            Baner
7      NaN  600.00       Baner road
8      1.0   63.25  Bhandarkar Road
9      NaN  370.00     Bhavani Peth

In [44]:
import pandas as pd
import numpy as np
data=pd.read_csv("D:/05_DATA CLEANING AND PREPROCESSING/eMPLYOEE RAW.csv")
print(data.head(10))

   Education  JoiningYear       City  PaymentTier  Age  Gender EverBenched  \
0  Bachelors         2017  Bangalore            3   34    Male          No
1  Bachelors         2013       Pune            1   28  Female          No
2  Bachelors         2014  New Delhi            3   38  Female          No
3    Masters         2016  Bangalore            3   27    Male          No
4    Masters         2017       Pune            3   24    Male         Yes
5  Bachelors         2016  Bangalore            3   22    Male          No
6  Bachelors         2015  New Delhi            3   38    Male          No
7  Bachelors         2016  Bangalore            3   34  Female          No
8  Bachelors         2016       Pune            3   23    Male          No
9    Masters         2017  New Delhi            2   37    Male          No

   ExperienceInCurrentDomain  LeaveOrNot
0                          0           0
1                          3           1
2                          2           0
3                          5           1
4                          2           1
5                          0           0
6                          0           0
7                          2           1
8                          1           0
9                          2           0

In [45]:
print(data.isnull())

      Education  JoiningYear   City  PaymentTier    Age  Gender  EverBenched  \
0         False        False  False        False  False   False        False
1         False        False  False        False  False   False        False
2         False        False  False        False  False   False        False
3         False        False  False        False  False   False        False
4         False        False  False        False  False   False        False
...         ...          ...    ...          ...    ...     ...          ...
4648      False        False  False        False  False   False        False
4649      False        False  False        False  False   False        False
4650      False        False  False        False  False   False        False
4651      False        False  False        False  False   False        False
4652      False        False  False        False  False   False        False

      ExperienceInCurrentDomain  LeaveOrNot
0                         False       False
1                         False       False
2                         False       False
3                         False       False
4                         False       False
...                         ...         ...
4648                      False       False
4649                      False       False
4650                      False       False
4651                      False       False
4652                      False       False

[4653 rows x 9 columns]

In [46]:
print(data.isnull().sum())

Education                    0
JoiningYear                  0
City                         0
PaymentTier                  0
Age                          0
Gender                       0
EverBenched                  0
ExperienceInCurrentDomain    0
LeaveOrNot                   0
dtype: int64

In [47]:
import pandas as pd
import numpy as np
data=pd.read_csv("D:/05_DATA CLEANING AND PREPROCESSING/eMPLYOEE RAW.csv")

In [48]:
print(data.head(14))

    Education  JoiningYear       City  PaymentTier  Age  Gender EverBenched  \
0   Bachelors         2017  Bangalore            3   34    Male          No
1   Bachelors         2013       Pune            1   28  Female          No
2   Bachelors         2014  New Delhi            3   38  Female          No
3     Masters         2016  Bangalore            3   27    Male          No
4     Masters         2017       Pune            3   24    Male         Yes
5   Bachelors         2016  Bangalore            3   22    Male          No
6   Bachelors         2015  New Delhi            3   38    Male          No
7   Bachelors         2016  Bangalore            3   34  Female          No
8   Bachelors         2016       Pune            3   23    Male          No
9     Masters         2017  New Delhi            2   37    Male          No
10    Masters         2012  Bangalore            3   27    Male          No
11  Bachelors         2016       Pune            3   34    Male          No
12  Bachelors         2018       Pune            3   32    Male         Yes
13  Bachelors         2016  Bangalore            3   39    Male          No

    ExperienceInCurrentDomain  LeaveOrNot
0                           0           0
1                           3           1
2                           2           0
3                           5           1
4                           2           1
5                           0           0
6                           0           0
7                           2           1
8                           1           0
9                           2           0
10                          5           1
11                          3           0
12                          5           1
13                          2           0

In [49]:
print(data.isnull())

      Education  JoiningYear   City  PaymentTier    Age  Gender  EverBenched  \
0         False        False  False        False  False   False        False
1         False        False  False        False  False   False        False
2         False        False  False        False  False   False        False
3         False        False  False        False  False   False        False
4         False        False  False        False  False   False        False
...         ...          ...    ...          ...    ...     ...          ...
4648      False        False  False        False  False   False        False
4649      False        False  False        False  False   False        False
4650      False        False  False        False  False   False        False
4651      False        False  False        False  False   False        False
4652      False        False  False        False  False   False        False

      ExperienceInCurrentDomain  LeaveOrNot
0                         False       False
1                         False       False
2                         False       False
3                         False       False
4                         False       False
...                         ...         ...
4648                      False       False
4649                      False       False
4650                      False       False
4651                      False       False
4652                      False       False

[4653 rows x 9 columns]

In [59]:
import pandas as pd
import numpy as np
data=pd.read_csv("D:/05_DATA CLEANING AND PREPROCESSING/bengaluru_house_prices.csv")

In [55]:
print(data.head(10))

              area_type   availability                  location       size  \
0  Super built-up  Area         19-Dec  Electronic City Phase II      2 BHK
1            Plot  Area  Ready To Move          Chikka Tirupathi  4 Bedroom
2        Built-up  Area  Ready To Move               Uttarahalli      3 BHK
3  Super built-up  Area  Ready To Move        Lingadheeranahalli      3 BHK
4  Super built-up  Area  Ready To Move                  Kothanur      2 BHK
5  Super built-up  Area  Ready To Move                Whitefield      2 BHK
6  Super built-up  Area         18-May          Old Airport Road      4 BHK
7  Super built-up  Area  Ready To Move              Rajaji Nagar      4 BHK
8  Super built-up  Area  Ready To Move              Marathahalli      3 BHK
9            Plot  Area  Ready To Move              Gandhi Bazar  6 Bedroom

   society total_sqft  bath  balcony   price
0  Coomee        1056   2.0      1.0   39.07
1  Theanmp       2600   5.0      3.0  120.00
2      NaN       1440   2.0      3.0   62.00
3  Soiewre       1521   3.0      1.0   95.00
4      NaN       1200   2.0      1.0   51.00
5  DuenaTa       1170   2.0      1.0   38.00
6  Jaades        2732   4.0      NaN  204.00
7  Brway G       3300   4.0      NaN  600.00
8      NaN       1310   3.0      1.0   63.25
9      NaN       1020   6.0      NaN  370.00

In [54]:
print(data.isnull())

       area_type  availability  location   size  society  total_sqft   bath  \
0          False         False     False  False    False       False  False
1          False         False     False  False    False       False  False
2          False         False     False  False     True       False  False
3          False         False     False  False    False       False  False
4          False         False     False  False     True       False  False
...          ...           ...       ...    ...      ...         ...    ...
13315      False         False     False  False    False       False  False
13316      False         False     False  False     True       False  False
13317      False         False     False  False    False       False  False
13318      False         False     False  False    False       False  False
13319      False         False     False  False     True       False  False

       balcony  price
0        False  False
1        False  False
2        False  False
3        False  False
4        False  False
...        ...    ...
13315    False  False
13316     True  False
13317    False  False
13318    False  False
13319    False  False

[13320 rows x 9 columns]

In [56]:
print(data.head(10))

              area_type   availability                  location       size  \
0  Super built-up  Area         19-Dec  Electronic City Phase II      2 BHK
1            Plot  Area  Ready To Move          Chikka Tirupathi  4 Bedroom
2        Built-up  Area  Ready To Move               Uttarahalli      3 BHK
3  Super built-up  Area  Ready To Move        Lingadheeranahalli      3 BHK
4  Super built-up  Area  Ready To Move                  Kothanur      2 BHK
5  Super built-up  Area  Ready To Move                Whitefield      2 BHK
6  Super built-up  Area         18-May          Old Airport Road      4 BHK
7  Super built-up  Area  Ready To Move              Rajaji Nagar      4 BHK
8  Super built-up  Area  Ready To Move              Marathahalli      3 BHK
9            Plot  Area  Ready To Move              Gandhi Bazar  6 Bedroom

   society total_sqft  bath  balcony   price
0  Coomee        1056   2.0      1.0   39.07
1  Theanmp       2600   5.0      3.0  120.00
2      NaN       1440   2.0      3.0   62.00
3  Soiewre       1521   3.0      1.0   95.00
4      NaN       1200   2.0      1.0   51.00
5  DuenaTa       1170   2.0      1.0   38.00
6  Jaades        2732   4.0      NaN  204.00
7  Brway G       3300   4.0      NaN  600.00
8      NaN       1310   3.0      1.0   63.25
9      NaN       1020   6.0      NaN  370.00

In [58]:
import numpy as np
print(data.replace(np.nan,"bhushan sanjay zade"))

                  area_type   availability                  location  \
0      Super built-up  Area         19-Dec  Electronic City Phase II
1                Plot  Area  Ready To Move          Chikka Tirupathi
2            Built-up  Area  Ready To Move               Uttarahalli
3      Super built-up  Area  Ready To Move        Lingadheeranahalli
4      Super built-up  Area  Ready To Move                  Kothanur
...                     ...            ...                       ...
13315        Built-up  Area  Ready To Move                Whitefield
13316  Super built-up  Area  Ready To Move             Richards Town
13317        Built-up  Area  Ready To Move     Raja Rajeshwari Nagar
13318  Super built-up  Area         18-Jun           Padmanabhanagar
13319  Super built-up  Area  Ready To Move              Doddathoguru

            size              society total_sqft bath              balcony  \
0          2 BHK              Coomee        1056  2.0                  1.0
1      4 Bedroom              Theanmp       2600  5.0                  3.0
2          3 BHK  bhushan sanjay zade       1440  2.0                  3.0
3          3 BHK              Soiewre       1521  3.0                  1.0
4          2 BHK  bhushan sanjay zade       1200  2.0                  1.0
...          ...                  ...        ...  ...                  ...
13315  5 Bedroom              ArsiaEx       3453  4.0                  0.0
13316      4 BHK  bhushan sanjay zade       3600  5.0  bhushan sanjay zade
13317      2 BHK              Mahla T       1141  2.0                  1.0
13318      4 BHK              SollyCl       4689  4.0                  1.0
13319      1 BHK  bhushan sanjay zade        550  1.0                  1.0

        price
0       39.07
1      120.00
2       62.00
3       95.00
4       51.00
...       ...
13315  231.00
13316  400.00
13317   60.00
13318  488.00
13319   17.00

[13320 rows x 9 columns]

In [60]:
print(data.head(10))

              area_type   availability                  location       size  \
0  Super built-up  Area         19-Dec  Electronic City Phase II      2 BHK
1            Plot  Area  Ready To Move          Chikka Tirupathi  4 Bedroom
2        Built-up  Area  Ready To Move               Uttarahalli      3 BHK
3  Super built-up  Area  Ready To Move        Lingadheeranahalli      3 BHK
4  Super built-up  Area  Ready To Move                  Kothanur      2 BHK
5  Super built-up  Area  Ready To Move                Whitefield      2 BHK
6  Super built-up  Area         18-May          Old Airport Road      4 BHK
7  Super built-up  Area  Ready To Move              Rajaji Nagar      4 BHK
8  Super built-up  Area  Ready To Move              Marathahalli      3 BHK
9            Plot  Area  Ready To Move              Gandhi Bazar  6 Bedroom

   society total_sqft  bath  balcony   price
0  Coomee        1056   2.0      1.0   39.07
1  Theanmp       2600   5.0      3.0  120.00
2      NaN       1440   2.0      3.0   62.00
3  Soiewre       1521   3.0      1.0   95.00
4      NaN       1200   2.0      1.0   51.00
5  DuenaTa       1170   2.0      1.0   38.00
6  Jaades        2732   4.0      NaN  204.00
7  Brway G       3300   4.0      NaN  600.00
8      NaN       1310   3.0      1.0   63.25
9      NaN       1020   6.0      NaN  370.00

In [61]:
print(data.fillna(method="bfill"))

                  area_type   availability                  location  \
0      Super built-up  Area         19-Dec  Electronic City Phase II
1                Plot  Area  Ready To Move          Chikka Tirupathi
2            Built-up  Area  Ready To Move               Uttarahalli
3      Super built-up  Area  Ready To Move        Lingadheeranahalli
4      Super built-up  Area  Ready To Move                  Kothanur
...                     ...            ...                       ...
13315        Built-up  Area  Ready To Move                Whitefield
13316  Super built-up  Area  Ready To Move             Richards Town
13317        Built-up  Area  Ready To Move     Raja Rajeshwari Nagar
13318  Super built-up  Area         18-Jun           Padmanabhanagar
13319  Super built-up  Area  Ready To Move              Doddathoguru

            size  society total_sqft  bath  balcony   price
0          2 BHK  Coomee        1056   2.0      1.0   39.07
1      4 Bedroom  Theanmp       2600   5.0      3.0  120.00
2          3 BHK  Soiewre       1440   2.0      3.0   62.00
3          3 BHK  Soiewre       1521   3.0      1.0   95.00
4          2 BHK  DuenaTa       1200   2.0      1.0   51.00
...          ...      ...        ...   ...      ...     ...
13315  5 Bedroom  ArsiaEx       3453   4.0      0.0  231.00
13316      4 BHK  Mahla T       3600   5.0      1.0  400.00
13317      2 BHK  Mahla T       1141   2.0      1.0   60.00
13318      4 BHK  SollyCl       4689   4.0      1.0  488.00
13319      1 BHK      NaN        550   1.0      1.0   17.00

[13320 rows x 9 columns]

C:\Users\bhush\AppData\Local\Temp\ipykernel_21064\2075060948.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  print(data.fillna(method="bfill"))

In [63]:
print(data.isnull)

<bound method DataFrame.isnull of                   area_type   availability                  location  \
0      Super built-up  Area         19-Dec  Electronic City Phase II
1                Plot  Area  Ready To Move          Chikka Tirupathi
2            Built-up  Area  Ready To Move               Uttarahalli
3      Super built-up  Area  Ready To Move        Lingadheeranahalli
4      Super built-up  Area  Ready To Move                  Kothanur
...                     ...            ...                       ...
13315        Built-up  Area  Ready To Move                Whitefield
13316  Super built-up  Area  Ready To Move             Richards Town
13317        Built-up  Area  Ready To Move     Raja Rajeshwari Nagar
13318  Super built-up  Area         18-Jun           Padmanabhanagar
13319  Super built-up  Area  Ready To Move              Doddathoguru

            size  society total_sqft  bath  balcony   price
0          2 BHK  Coomee        1056   2.0      1.0   39.07
1      4 Bedroom  Theanmp       2600   5.0      3.0  120.00
2          3 BHK      NaN       1440   2.0      3.0   62.00
3          3 BHK  Soiewre       1521   3.0      1.0   95.00
4          2 BHK      NaN       1200   2.0      1.0   51.00
...          ...      ...        ...   ...      ...     ...
13315  5 Bedroom  ArsiaEx       3453   4.0      0.0  231.00
13316      4 BHK      NaN       3600   5.0      NaN  400.00
13317      2 BHK  Mahla T       1141   2.0      1.0   60.00
13318      4 BHK  SollyCl       4689   4.0      1.0  488.00
13319      1 BHK      NaN        550   1.0      1.0   17.00

[13320 rows x 9 columns]>

In [64]:
print(data.isnull())

       area_type  availability  location   size  society  total_sqft   bath  \
0          False         False     False  False    False       False  False
1          False         False     False  False    False       False  False
2          False         False     False  False     True       False  False
3          False         False     False  False    False       False  False
4          False         False     False  False     True       False  False
...          ...           ...       ...    ...      ...         ...    ...
13315      False         False     False  False    False       False  False
13316      False         False     False  False     True       False  False
13317      False         False     False  False    False       False  False
13318      False         False     False  False    False       False  False
13319      False         False     False  False     True       False  False

       balcony  price
0        False  False
1        False  False
2        False  False
3        False  False
4        False  False
...        ...    ...
13315    False  False
13316     True  False
13317    False  False
13318    False  False
13319    False  False

[13320 rows x 9 columns]

In [66]:
print(data.fillna(method="bfill"))

                  area_type   availability                  location  \
0      Super built-up  Area         19-Dec  Electronic City Phase II
1                Plot  Area  Ready To Move          Chikka Tirupathi
2            Built-up  Area  Ready To Move               Uttarahalli
3      Super built-up  Area  Ready To Move        Lingadheeranahalli
4      Super built-up  Area  Ready To Move                  Kothanur
...                     ...            ...                       ...
13315        Built-up  Area  Ready To Move                Whitefield
13316  Super built-up  Area  Ready To Move             Richards Town
13317        Built-up  Area  Ready To Move     Raja Rajeshwari Nagar
13318  Super built-up  Area         18-Jun           Padmanabhanagar
13319  Super built-up  Area  Ready To Move              Doddathoguru

            size  society total_sqft  bath  balcony   price
0          2 BHK  Coomee        1056   2.0      1.0   39.07
1      4 Bedroom  Theanmp       2600   5.0      3.0  120.00
2          3 BHK  Soiewre       1440   2.0      3.0   62.00
3          3 BHK  Soiewre       1521   3.0      1.0   95.00
4          2 BHK  DuenaTa       1200   2.0      1.0   51.00
...          ...      ...        ...   ...      ...     ...
13315  5 Bedroom  ArsiaEx       3453   4.0      0.0  231.00
13316      4 BHK  Mahla T       3600   5.0      1.0  400.00
13317      2 BHK  Mahla T       1141   2.0      1.0   60.00
13318      4 BHK  SollyCl       4689   4.0      1.0  488.00
13319      1 BHK      NaN        550   1.0      1.0   17.00

[13320 rows x 9 columns]

C:\Users\bhush\AppData\Local\Temp\ipykernel_21064\2075060948.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  print(data.fillna(method="bfill"))

In [67]:
print(data.isnull())

       area_type  availability  location   size  society  total_sqft   bath  \
0          False         False     False  False    False       False  False
1          False         False     False  False    False       False  False
2          False         False     False  False     True       False  False
3          False         False     False  False    False       False  False
4          False         False     False  False     True       False  False
...          ...           ...       ...    ...      ...         ...    ...
13315      False         False     False  False    False       False  False
13316      False         False     False  False     True       False  False
13317      False         False     False  False    False       False  False
13318      False         False     False  False    False       False  False
13319      False         False     False  False     True       False  False

       balcony  price
0        False  False
1        False  False
2        False  False
3        False  False
4        False  False
...        ...    ...
13315    False  False
13316     True  False
13317    False  False
13318    False  False
13319    False  False

[13320 rows x 9 columns]

In [69]:
import numpy as np
data["society"]=data["society"].replace(np.nan,"bhsuhamsanjay zacde")
print(data)

                  area_type   availability                  location  \
0      Super built-up  Area         19-Dec  Electronic City Phase II
1                Plot  Area  Ready To Move          Chikka Tirupathi
2            Built-up  Area  Ready To Move               Uttarahalli
3      Super built-up  Area  Ready To Move        Lingadheeranahalli
4      Super built-up  Area  Ready To Move                  Kothanur
...                     ...            ...                       ...
13315        Built-up  Area  Ready To Move                Whitefield
13316  Super built-up  Area  Ready To Move             Richards Town
13317        Built-up  Area  Ready To Move     Raja Rajeshwari Nagar
13318  Super built-up  Area         18-Jun           Padmanabhanagar
13319  Super built-up  Area  Ready To Move              Doddathoguru

            size              society total_sqft  bath  balcony   price
0          2 BHK              Coomee        1056   2.0      1.0   39.07
1      4 Bedroom              Theanmp       2600   5.0      3.0  120.00
2          3 BHK  bhsuhamsanjay zacde       1440   2.0      3.0   62.00
3          3 BHK              Soiewre       1521   3.0      1.0   95.00
4          2 BHK  bhsuhamsanjay zacde       1200   2.0      1.0   51.00
...          ...                  ...        ...   ...      ...     ...
13315  5 Bedroom              ArsiaEx       3453   4.0      0.0  231.00
13316      4 BHK  bhsuhamsanjay zacde       3600   5.0      NaN  400.00
13317      2 BHK              Mahla T       1141   2.0      1.0   60.00
13318      4 BHK              SollyCl       4689   4.0      1.0  488.00
13319      1 BHK  bhsuhamsanjay zacde        550   1.0      1.0   17.00

[13320 rows x 9 columns]

In [70]:
import pandas as pd
import numpy as np
data=pd.read_csv("D:/05_DATA CLEANING AND PREPROCESSING/bengaluru_house_prices.csv")

In [71]:
print(data.fillna("bhuvgdjhhgfjshfjdsfghfadhfdkjhdksjhk"))

                  area_type   availability                  location  \
0      Super built-up  Area         19-Dec  Electronic City Phase II
1                Plot  Area  Ready To Move          Chikka Tirupathi
2            Built-up  Area  Ready To Move               Uttarahalli
3      Super built-up  Area  Ready To Move        Lingadheeranahalli
4      Super built-up  Area  Ready To Move                  Kothanur
...                     ...            ...                       ...
13315        Built-up  Area  Ready To Move                Whitefield
13316  Super built-up  Area  Ready To Move             Richards Town
13317        Built-up  Area  Ready To Move     Raja Rajeshwari Nagar
13318  Super built-up  Area         18-Jun           Padmanabhanagar
13319  Super built-up  Area  Ready To Move              Doddathoguru

            size                               society total_sqft bath  \
0          2 BHK                               Coomee        1056  2.0
1      4 Bedroom                               Theanmp       2600  5.0
2          3 BHK  bhuvgdjhhgfjshfjdsfghfadhfdkjhdksjhk       1440  2.0
3          3 BHK                               Soiewre       1521  3.0
4          2 BHK  bhuvgdjhhgfjshfjdsfghfadhfdkjhdksjhk       1200  2.0
...          ...                                   ...        ...  ...
13315  5 Bedroom                               ArsiaEx       3453  4.0
13316      4 BHK  bhuvgdjhhgfjshfjdsfghfadhfdkjhdksjhk       3600  5.0
13317      2 BHK                               Mahla T       1141  2.0
13318      4 BHK                               SollyCl       4689  4.0
13319      1 BHK  bhuvgdjhhgfjshfjdsfghfadhfdkjhdksjhk        550  1.0

                                    balcony   price
0                                       1.0   39.07
1                                       3.0  120.00
2                                       3.0   62.00
3                                       1.0   95.00
4                                       1.0   51.00
...                                     ...     ...
13315                                   0.0  231.00
13316  bhuvgdjhhgfjshfjdsfghfadhfdkjhdksjhk  400.00
13317                                   1.0   60.00
13318                                   1.0  488.00
13319                                   1.0   17.00

[13320 rows x 9 columns]